import React from 'react';

const Delivery = () => {
    return (
        <div className='delivery'>
            <div className="container">
                <h1>Доставка</h1>
                <p className="po">Служба доставки компании «ФлораМаркт» осуществляет доставку цветов и букетов в любое удобное для Вас время 365 дней в году, мы работаем без выходных и праздников. Мы готовы нести красоту и радость каждому, кто обратится к нам.</p>
                <div className="container2">
                    <h2>Как оформить заказ с доставкой</h2>
                    <p className="pa">Оформить срочную или обычную заявку на доставку букета можно как по телефону, ежедневно с 9-00 до 21-00, так и через сайт — круглосуточно. Если стоимость заказа не менее 5000 рублей — доставка цветов бесплатная. <br /> <br />
                       Стоимость доставки цветочных букетов в пределах МКАД напрямую зависит от адреса заказчика и объема заказа. <br /> <br />
                       Стоимость доставки заказа в пределах МКАД:
                    </p>
                    <div className="cont">
                        <div className="con1">
                            <div className="tab1"><p>Время доставки</p></div>
                            <div className="tab2"><p>Более 3 (трех) часов</p></div>
                            <div className="tab3"><p>Срочная от 1-3 часов</p></div>
                            <div className="tab2"><p>К определенному времени</p></div>
                            <div className="tab3"><p>В город</p></div>
                            <div className="tab2"><p>Доставка ночью</p></div>
                        </div>
                        <div className="con1">
                            <div className="tab1"><p>Сумма заказа от 300 C</p></div>
                            <div className="tab2"><p>200 C</p></div>
                            <div className="tab3"><p>800 C</p></div>
                            <div className="tab2"><p>300 C</p></div>
                            <div className="tab3"><p>400 С</p></div>
                            <div className="tab2"><p>1000 C</p></div>
                        </div>
                        <div className="con1">
                            <div className="tab1"><p>Сумма заказа от 300 C</p></div>
                            <div className="tab2"><p>200 C</p></div>
                            <div className="tab3"><p>800 C</p></div>
                            <div className="tab2"><p>300 C</p></div>
                            <div className="tab3"><p>400 C</p></div>
                            <div className="tab2"><p>1000 C</p></div>
                        </div>
                    </div>
                </div>
                <div className="container3">
                    <h2>Особые условия</h2>
                    <p className="p">Скидочные карты действуют только в магазинах, при предъявлении! <br /><br />
                       При бесплатной доставке, скидочные карты не действуют! <br /><br />
                       При заказе товаров по акции, бесплатная доставка не действует! <br /><br />
                    </p>
                    <p>
                        В том случае, если во время привоза вас не оказалось на месте, стоимость повторной доставки будет платной (500 рублей). В предпраздничные и праздничные (Новый год, Международный женский день, День Святого Валентина) оформление заявки на срочные заказы не принимается.  <br /><br />
                        Если шкала пробок поднялась выше 8 баллов, мы не гарантируем, что сможем привезти цветы в пределах того временного промежутка, который был оговорен.  <br /><br />
                        В преддверии больших праздников, чтобы получить красивые и свежие цветы вовремя рекомендуется заранее оформлять заказ. Ярких и неожиданных вам моментов!  <br /><br />
                    </p>
                </div>
            </div>
        </div>
    );
}

export default Delivery;
